package main

import (
	"fmt"
	"math"
)

func main() {

	// объявляем слайсы с числами
	a := []float64{123123123123, 12, 43534543535454, 745645, 231231231574546434}
	b := []float64{2, 12312312321123123, 5234424234324234, 11, 12312}

	// объявляем переменную, с которой будем сравнивать элементы слайсов
	c := float64(math.Pow(2, 20))

	// проходим по слайсам
	for i := 0; i < len(a) && i < len(b); i++ {
		// если элементы обоих слайсов больше, чем c, то выполняем операции
		if a[i] > c && b[i] > c {
			fmt.Printf("%v + %v = %v\n", a[i], b[i], a[i]+b[i])
			fmt.Printf("%v - %v = %v\n", a[i], b[i], a[i]-b[i])
			fmt.Printf("%v * %v = %v\n", a[i], b[i], a[i]*b[i])
			fmt.Printf("%v / %v = %v\n", a[i], b[i], a[i]/b[i])
		}
	}
}
